Documents/ЗаявкаНаОткрытиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОткрытиеСчета</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭПКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеВ1СДиректБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛицаПодробно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяИнтеграцияССервисомАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Банки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкиУниверсальногоОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПродукта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправлятьСогласие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОтсутствуют</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиДополнительнойИнформации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДопИнформации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкиУниверсальногоОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоФайл</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиФайла</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОтсутствуют</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Валюты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ФинУслугиКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОжидатьЗавершениеОбновленияДанныхСервиса(Форма) Экспорт
	
	СведенияОДлительнойОперации = Форма.СведенияОДлительнойОперации;
	Если СведенияОДлительнойОперации.ДлительнаяОперация <> Неопределено
		И СведенияОДлительнойОперации.Имя = "ОбновитьДанныеСервиса" Тогда
		
		// В настоящее время еще выполняется фоновое задание по обновлению данных из сервиса,
		// дождемся его завершения.
		ТекстПоясненияОжидания = НСтр("ru = 'Поиск предложений банков'");
		
	Иначе
		
		// В модели сервиса фоновое задание не запущено.
		ОбновитьФормуПослеОбновленияДанныхСервиса(Форма, "");

		Возврат;
		
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);

	ОповещенияОЗавершении = Новый ОписаниеОповещения("ОбновлениеДанныхСервисаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		СведенияОДлительнойОперации.ДлительнаяОперация,
		ОповещенияОЗавершении,
		ПараметрыОжидания);

КонецПроцедуры

Процедура ОбновлениеДанныхСервисаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;	
	КонецЕсли;
	Форма = ДополнительныеПараметры.Форма;
	ТекстОшибки = "";
	Форма.СведенияОДлительнойОперации.ДлительнаяОперация = Неопределено; // Сбросим признак выполнения.
	
	ОписаниеОшибкиОбновленияДанныхСервиса = "";
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус", "") = "Ошибка" Тогда
		// Сохраним описание ошибки.
		ОписаниеОшибкиОбновленияДанныхСервиса = Результат.КраткоеПредставлениеОшибки;
		ТекстОшибки = 
			УниверсальныйОбменСБанкамиВызовСервера.ПодготовитьТекстОшибкиОбновленияДанныхСервиса(ОписаниеОшибкиОбновленияДанныхСервиса);
	Иначе
			
		РезультатОбновленияДанных = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		Если РезультатОбновленияДанных.ИмяСобытия <> "ДанныеАктуальны" Тогда
			// Ошибка результата фонового задания. Сохраним и отобразим ее описание ошибки.
			ЕстьОшибки = Истина;
			
			ОписаниеОшибкиОбновленияДанныхСервиса = РезультатОбновленияДанных.ОписаниеСобытия;
			Если РезультатОбновленияДанных.ИмяСобытия = "ОшибкаАвторизацииПоЛогину" Тогда
				
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Ошибка при авторизации по логину ИТС: %1
                                                |Проверьте правильность указания пользователя и пароля.'"); 
				ОшибкаАвторизацииПоЛогину = Истина;
				
			ИначеЕсли РезультатОбновленияДанных.ИмяСобытия = "ОшибкаПриПолученииТикета" Тогда
				
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Ошибка прав доступа к ресурсу (тикета): %1
                                                |Обратитесь к админинстраторам ресурса.'");
				
			ИначеЕсли РезультатОбновленияДанных.ИмяСобытия = "ОшибкаПриПолученииДанных" Тогда
				
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Ошибка при получении данных: %1
                                                |Попробуйте повторно запустить обновление данных сервиса.'");
				                              
			КонецЕсли;
			Если РезультатОбновленияДанных.ИмяСобытия = "Ошибка" Тогда
				ТекстОшибки = УниверсальныйОбменСБанкамиВызовСервера.ПодготовитьТекстОшибкиОбновленияДанныхСервиса(
					ОписаниеОшибкиОбновленияДанныхСервиса);
			Иначе
				ТекстОшибки = СтрШаблон(ШаблонСообщенияОбОшибке, ОписаниеОшибкиОбновленияДанныхСервиса);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;

	ОбновитьФормуПослеОбновленияДанныхСервиса(Форма, ТекстОшибки);

КонецПроцедуры

Процедура ОжидатьЗавершениеПолученияПредложений(Форма) Экспорт
	
	Если ФинУслугиКлиентСервер.ЭтоФормаСИнформационнойПанелью(Форма.ИмяФормы) И Форма.КоличествоБаннеров = 0 Тогда
		Возврат;
	КонецЕсли;

	СведенияОДлительнойОперации = Форма.СведенияОДлительнойОперации;
	Если СведенияОДлительнойОперации.ДлительнаяОперация <> Неопределено
		И СведенияОДлительнойОперации.Имя = "ПолучитьПредложения" Тогда
		
		// В настоящее время еще выполняется фоновое задание по обновлению данных из сервиса,
		// дождемся его завершения.
		ТекстПоясненияОжидания = НСтр("ru = 'Получение предложений банков'");
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);

	ОповещенияОЗавершении = Новый ОписаниеОповещения("ПолучениеПредложенийЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		СведенияОДлительнойОперации.ДлительнаяОперация,
		ОповещенияОЗавершении,
		ПараметрыОжидания);

КонецПроцедуры

Процедура ПолучениеПредложенийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;	
	КонецЕсли;
	Форма = ДополнительныеПараметры.Форма;
	ТекстОшибки = "";
	Форма.СведенияОДлительнойОперации.ДлительнаяОперация = Неопределено; // Сбросим признак выполнения.
	
	ОписаниеОшибки = "";
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус", "") <> "Ошибка" Тогда
		
		Форма.ОбновитьОтображениеФинУслуги(Результат.АдресРезультата);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВыбораИзМенюБаннер(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "Перейти" Тогда
		
		ИмяРеквизита = СтрШаблон("Баннер%1Идентификатор", ДополнительныеПараметры.НомерБаннера);
		ПерейтиПоНавигационнойСсылкеБаннера(Форма, ИмяРеквизита, 
			ДополнительныеПараметры.Организация, ДополнительныеПараметры.Банк);
			
	ИначеЕсли ВыбранныйЭлемент.Значение = "Скрыть" Тогда
		
		ИмяРеквизита = СтрШаблон("Баннер%1Идентификатор", ДополнительныеПараметры.НомерБаннера);
		Идентификатор = Форма[ИмяРеквизита];
		ПрямоеНаправление = Форма.ТекущаяПозицияБаннеры = 1;
		ФинУслугиВызовСервера.СкрытьБаннерПоИдентификатору(Идентификатор, Форма.ТекущаяПозицияБаннеры); 
		ОбновитьРотациюБаннеров(Форма, ПрямоеНаправление, Истина);

	КонецЕсли;
	
КонецПроцедуры

Процедура ПерейтиПоНавигационнойСсылкеБаннера(Форма, ИмяРеквизита, Организация, Банк) Экспорт
	
	ИдентификаторУслуги = Форма[ИмяРеквизита];
	Отбор = Новый Структура("ИдентификаторУслуги", ИдентификаторУслуги);
	МассивПредложений = Форма.ТаблицаПредложенийБанков.НайтиСтроки(Отбор);
	
	Если МассивПредложений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НавигационнаяСсылка = МассивПредложений[0].НавигационнаяСсылка; 
	
	Если НавигационнаяСсылка = "ДиректБанк" Тогда
		
		Если ФинУслугиВызовСервера.РолиДоступны() Тогда
			ОбменСБанкамиКлиент.ОткрытьСоздатьНастройкуОбмена(Организация, Банк);
			НавигационнаяСсылка = "";
		Иначе
			НавигационнаяСсылка = Сайт1С(ФинУслугиКлиент.СервисДиректБанк());
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылка = "ФинОтчетность" Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Организация", Организация);  
		БанкУниверсальногоОбмена = ФинУслугиВызовСервера.БанкУниверсальногоОбменаПоБанку(Банк);
		ПараметрыФормы.Вставить("Банк", БанкУниверсальногоОбмена);
		
		ОткрытьФорму("РегистрСведений.ЖурналСтатусовФинОтчетностиВБанки.ФормаСписка", ПараметрыФормы);
				
		НавигационнаяСсылка = "";

	ИначеЕсли НавигационнаяСсылка = "СПАРКРиски" Тогда
		
		ОткрытьФорму("Документ.СправкиСПАРКРиски.Форма.ФормаСписка");
		НавигационнаяСсылка = "";

	ИначеЕсли НавигационнаяСсылка = "Контрагент" Тогда
		
		ОткрытьФорму("Отчет.ДосьеКонтрагента.Форма");
        НавигационнаяСсылка = "";

	ИначеЕсли НавигационнаяСсылка = "СБП" Тогда
		
		Если ФинУслугиВызовСервера.РолиДоступны() Тогда
			ПерейтиПодключитьСБП();
			НавигационнаяСсылка = "";
		Иначе 
			НавигационнаяСсылка = Сайт1С(ФинУслугиКлиент.СервисСБП());
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылка = "ОткрытиеСчета" Тогда
		
		Если ФинУслугиВызовСервера.РолиДоступны() Тогда

			ПараметрыОткрываемойФормы = Новый Структура;
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("Организация", Организация);
			ПараметрыОткрываемойФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ОткрытьФорму("Документ.ЗаявкаНаОткрытиеСчета.Форма.ФормаДокумента", ПараметрыОткрываемойФормы);
			НавигационнаяСсылка = "";

		Иначе
			
			НавигационнаяСсылка = Сайт1С(ФинУслугиКлиент.СервисОткрытиеСчета());
			
		КонецЕсли;;
		
	ИначеЕсли НавигационнаяСсылка = "Кредит" Тогда
		
		ПерейтиПоСсылкеКредитЛизинг(Ложь, Организация);
		НавигационнаяСсылка = "";
	
	ИначеЕсли НавигационнаяСсылка = "Лизинг" Тогда
		
		ПерейтиПоСсылкеКредитЛизинг(Истина, Организация);
		НавигационнаяСсылка = "";
		
	ИначеЕсли ЗначениеЗаполнено(МассивПредложений[0].НавигационнаяСсылкаСПараметрами) Тогда
		
		НавигационнаяСсылка = МассивПредложений[0].НавигационнаяСсылкаСПараметрами;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
		
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
				
	КонецЕсли;
	
	ФинУслугиКлиентСервер.ДополнитьТаблицуСтатистики(Форма.ТаблицаСтатистики, МассивПредложений[0], 0, 1, Форма.ИмяФормы);
		
КонецПроцедуры

Процедура ПерейтиПоСсылкеКредитЛизинг(Это1СЛизинг, Организация) Экспорт
			
	Если Это1СЛизинг Тогда
		СервисОбменаСБанками = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаЛизинг");
		КлючеваяОперация = "СозданиеФормыЗаявкаНаЛизинг";
		Сайт = ФинУслугиКлиент.Сайт1С(ФинУслугиКлиент.СервисЛизинг());
	Иначе
		СервисОбменаСБанками = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит");
		КлючеваяОперация = "СозданиеФормыЗаявкаНаКредит"; 
		Сайт = ФинУслугиКлиент.Сайт1С(ФинУслугиКлиент.СервисКредит());
	КонецЕсли;
	
	Если Не ФинУслугиВызовСервера.РолиДоступны() Тогда
		ПерейтиПоНавигационнойСсылке(Сайт);
		Возврат;
	КонецЕсли;

	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
	
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);
	ЗначенияЗаполнения.Вставить("Организация", Организация);

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ЗаявкаНаКредит.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

Процедура ПерейтиПодключитьСБП()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодключенияСБП", ЭтотОбъект);	
	ПараметрыПодключения = СистемаБыстрыхПлатежейКлиент.НовыйПараметрыПодключения(Неопределено, Неопределено);
	
	СистемаБыстрыхПлатежейКлиент.ПодключитьСистемуБыстрыхПлатежей(
		ПараметрыПодключения,
		ОписаниеОповещения);

КонецПроцедуры

Процедура ПослеПодключенияСБП(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("ИзмененаНастройкаОбмена");
	ПоказатьОповещениеПользователя(НСтр("ru = 'Создано подключение к СБП'"));
	
	
КонецПроцедуры

Процедура ОбновитьРотациюБаннеров(Форма, НаправлениеВперед, ПолучитьПредложения = Ложь) Экспорт
	
	// После скрытия баннеров получим предложения
	Если ПолучитьПредложения Тогда
		Форма.ПолучитьПредложенияБанков();
		ОжидатьЗавершениеПолученияПредложений(Форма);
	КонецЕсли;
	
	Форма.ОбновитьБаннеры(НаправлениеВперед);

КонецПроцедуры

Процедура ПерейтиПоСсылке(Услуга, ТаблицаПредложенийБанков, ТаблицаСтатистики, ИмяФормы) Экспорт
	
	Отбор = Новый Структура(Услуга, Истина);
	СтрокиПредложений = ТаблицаПредложенийБанков.НайтиСтроки(Отбор);
	
	Сервис = СоответствиеСервисыУслуги().Получить(Услуга);

	Если СтрокиПредложений.Количество() > 0 Тогда
		
		Если ЗначениеЗаполнено(СтрокиПредложений[0].НавигационнаяСсылкаСПараметрами) Тогда
			Сайт = СтрокиПредложений[0].НавигационнаяСсылкаСПараметрами;
		Иначе	
			Сайт = СтрокиПредложений[0].НавигационнаяСсылка;
		КонецЕсли;
		ФинУслугиКлиентСервер.ДополнитьТаблицуСтатистики(ТаблицаСтатистики, СтрокиПредложений[0], 0, 1, ИмяФормы);

	Иначе
		
		Сайт = ?(Сервис = СервисСБП(), Сайт1С(Сервис), СайтИТС(Сервис));
		
	КонецЕсли;
	
	ПерейтиПоНавигационнойСсылке(Сайт);	

КонецПроцедуры

Функция Сайт1С(Сервис) Экспорт
	
	Возврат СтрШаблон("https://v8.1c.ru/tekhnologii/obmen-dannymi-i-integratsiya/realizovannye-resheniya/%1/", Сервис);
	
КонецФункции

Функция СайтИТС(Сервис) Экспорт
	
	Возврат СтрШаблон("https://its.1c.ru/db/%1/", Сервис);
	
КонецФункции

Функция СервисКредит() Экспорт
	
	Возврат "1s-kredit";
	
КонецФункции

Функция СервисЛизинг() Экспорт
	
	Возврат "1s-lizing";
	
КонецФункции

Функция СервисСБП() Экспорт
	
	Возврат "sistema-bystrykh-platezhey";
	
КонецФункции

Функция СервисОткрытиеСчета() Экспорт
	
	Возврат "servis-1s-otkrytie-scheta";
	
КонецФункции

Функция СервисДиректБанк() Экспорт
	
	Возврат "directbank-pryamoy-obmen-s-bankom";
	
КонецФункции

Функция СервисБизнесКарты() Экспорт
	
	Возврат "hoosn/content/754/1cbuh8-3";
	
КонецФункции

Функция СервисЭквайринг() Экспорт
	
	Возврат "contracts#content:28878:hdoc";
	
КонецФункции

Функция СервисЗарплатныйПроект() Экспорт
	
	Возврат "staff1c#content:34878:buh30:_top:зарплатный%20проект";
	
КонецФункции

Процедура ОжидатьЗавершениеОтправкиСтатистикиВСервис(Форма) Экспорт
	
	Если Форма.СведенияОДлительнойОперацииСтатистика.ДлительнаяОперация <> Неопределено Тогда
		
		// В настоящее время еще выполняется фоновое задание по отправке статистики в сервис,
		// дождемся его завершения.
		ТекстПоясненияОжидания = НСтр("ru = 'Отправка статистики'");
		
	Иначе
		
		// Фоновое задание не запущено.
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СведенияОДлительнойОперацииСтатистика", Форма.СведенияОДлительнойОперацииСтатистика); 
	ДополнительныеПараметры.Вставить("АдресХранилищаОтправкаСтатистики", Форма.АдресХранилищаОтправкаСтатистики);
    ДополнительныеПараметры.Вставить("ТаблицаСтатистики", Форма.ТаблицаСтатистики);
    ДополнительныеПараметры.Вставить("ТокенАвторизации", Форма.ТокенАвторизации);

	ОповещенияОЗавершении = Новый ОписаниеОповещения("ОтправкаСтатистикиВСервисЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		Форма.СведенияОДлительнойОперацииСтатистика.ДлительнаяОперация,
		ОповещенияОЗавершении,
		ПараметрыОжидания);

КонецПроцедуры

Процедура ПодменюБаннер(Форма, Команда, Организация, Банк, РазрешениеЭкрана = "") Экспорт
	
	СписокВыбора = Новый СписокЗначений; 
	СписокВыбора.Добавить("Перейти",  НСтр("ru='Перейти'"));
	СписокВыбора.Добавить("Скрыть",  НСтр("ru='Скрыть'"));

	ИмяЭлемента = Форма.ТекущийЭлемент.Имя; 
	ИмяЭлементаБезПостфикса = СтрЗаменить(ИмяЭлемента, РазрешениеЭкрана, "");
	НомерБаннера = СтрЗаменить(ИмяЭлементаБезПостфикса, Команда.Имя, "");
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("НомерБаннера", СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НомерБаннера));
	ДополнительныеПараметры.Вставить("Форма", Форма);
    ДополнительныеПараметры.Вставить("Организация", Организация);
    ДополнительныеПараметры.Вставить("Банк", Банк);

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМенюБаннер", ЭтотОбъект, ДополнительныеПараметры); 
	Форма.ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Форма.Элементы[Форма.ТекущийЭлемент.Имя]);
	
КонецПроцедуры

Процедура ОтправкаСтатистикиВСервисЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;	
	КонецЕсли;
	СведенияОДлительнойОперации = ДополнительныеПараметры.СведенияОДлительнойОперацииСтатистика;
	СведенияОДлительнойОперации.ДлительнаяОперация = Неопределено; // Сбросим признак выполнения.
	
	ОписаниеОшибки = "";
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус", "") <> "Ошибка" Тогда
		
		Если Не ЭтоАдресВременногоХранилища(ДополнительныеПараметры.АдресХранилищаОтправкаСтатистики) Тогда
			Возврат;
		КонецЕсли;
		РезультатВыполнения = ПолучитьИзВременногоХранилища(ДополнительныеПараметры.АдресХранилищаОтправкаСтатистики); 
		Если ТипЗнч(РезультатВыполнения) <> Тип("Структура") Тогда
			Возврат;
		КонецЕсли;
		Если РезультатВыполнения.Выполнено Тогда
		
			ДополнительныеПараметры.ТокенАвторизации = РезультатВыполнения.Токен;
			ДополнительныеПараметры.ТаблицаСтатистики.Очистить();
			

		КонецЕсли;
		
		УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресХранилищаОтправкаСтатистики);
		ДополнительныеПараметры.АдресХранилищаОтправкаСтатистики = "";

	КонецЕсли;

КонецПроцедуры

Процедура ПриИзмененииВариантаПанели(Форма) Экспорт
	
	Элементы = Форма.Элементы; 
	ВидимостьПлатежи = Форма.ВариантПанели = "Платежи";
	Элементы.ГруппаПлатежиИРасчеты.Видимость = ВидимостьПлатежи;
	
	Если ВидимостьПлатежи Тогда
		ОбменСБанкамиДепозитыВызовСервера.ОбработатьЗакрытиеПанелиРасчетаДепозитов();
	КонецЕсли;

	ИмяКоманды = ОбменСБанкамиДепозитыКлиентСервер.ИмяКоманды("ПоказатьРасчетДепозитов");
	ОбменСБанкамиДепозитыКлиент.ВыполнитьКоманду(Форма,
		Форма.ОбменСБанкамиДепозиты_ПараметрыПредложений, Неопределено, ИмяКоманды);
	
КонецПроцедуры

Процедура ОжидатьЗаполнениеКалендаря(Форма) Экспорт
	
	Если Форма.ДлительнаяОперацияПлатежныйКалендарь.ДлительнаяОперация <> Неопределено Тогда
		
		// В настоящее время еще выполняется фоновое задание по отправке статистики в сервис,
		// дождемся его завершения.
		ТекстПоясненияОжидания = НСтр("ru = 'Получение данных о платежах'");
		
	Иначе
		
		// Фоновое задание не запущено.
		Возврат;
		
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура("Форма", Форма);
	ОповещенияОЗавершении = Новый ОписаниеОповещения("ЗаполнениеПлатежногоКалендаряЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ВывестиПрогрессВыполнения", ЭтотОбъект, ДополнительныеПараметры);

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		Форма.ДлительнаяОперацияПлатежныйКалендарь.ДлительнаяОперация,
		ОповещенияОЗавершении,
		ПараметрыОжидания);

КонецПроцедуры

Процедура ВывестиПрогрессВыполнения(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Свойство("Прогресс")
	 Или ТипЗнч(Результат.Прогресс) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Прогресс = Результат.Прогресс;
	Если Не Прогресс.Свойство("Процент") Тогда
		Возврат;
	КонецЕсли;

	Процент = Прогресс.Процент;
	УстановитьНадписьПолучениеДанных(ДополнительныеПараметры.Форма, Процент);
	
КонецПроцедуры

Процедура ЗаполнениеПлатежногоКалендаряЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;	
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	Форма.ДлительнаяОперацияПлатежныйКалендарь.ДлительнаяОперация = Неопределено; // Сбросим признак выполнения.
	
	ОписаниеОшибки = "";
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус", "") = "Ошибка" Тогда
		ОписаниеОшибки = Результат.КраткоеПредставлениеОшибки;
		УстановитьТекстОшибкиДлительнойОперации(ОписаниеОшибки, ДополнительныеПараметры);
	Иначе
        АдресТаблицыПлатежей = Результат.АдресРезультата;
		ФинУслугиВызовСервера.ЗаполнитьТаблицыПлатежей(Форма.ДанныеПлатежейСегодня, АдресТаблицыПлатежей);
		Если Форма.ДанныеПлатежейСегодня.ИнфоПанель Тогда 
			Форма.ВывестиПлатежиСегодня();
		Иначе
			Форма.ВывестиДанныеПлатежногоКалендаря();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьТекстОшибкиДлительнойОперации(ОписаниеОшибки, ДополнительныеПараметры) 
	
	Форма = ДополнительныеПараметры.Форма; 
	Если ФинУслугиКлиентСервер.ЭтоФормаФинансыОрганизации(Форма.ИмяФормы) Тогда
		РазрешениеЭкрана = Форма.РазрешениеЭкрана;
	Иначе
		РазрешениеЭкрана = "";
	КонецЕсли;
	ИмяЭлемента = СтрШаблон("ТекстДлительнойОперации%1", РазрешениеЭкрана);
	Форма.Элементы[ИмяЭлемента].Заголовок = СтрШаблон(НСтр("ru = 'Ошибка получения данных: %1'"), ОписаниеОшибки);
	ФинУслугиКлиентСервер.УстановитьВидимостьЭлемента(Форма.Элементы, "ДекорацияДлительнаяОперация", Ложь, РазрешениеЭкрана);

КонецПроцедуры

Процедура УстановитьНадписьПолучениеДанных(Форма, Процент) Экспорт 
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "РазрешениеЭкрана") Тогда
		РазрешениеЭкрана = Форма.РазрешениеЭкрана;
	Иначе
		РазрешениеЭкрана = "";
	КонецЕсли;
	ИмяЭлемента = СтрШаблон("ТекстДлительнойОперации%1", РазрешениеЭкрана);
	Форма.Элементы[ИмяЭлемента].Заголовок = СтрШаблон(НСтр("ru = 'Получение данных %1 %2...'"), Процент, "%");

КонецПроцедуры

Процедура РасшифроватьПоказательПлатежиСегодня(Элемент, ДанныеПлатежейСегодня) Экспорт
	
	ИмяЭлемента = Элемент.Имя;
		
	ПараметрыОтчета = ПараметрыОтчетаАнализСубконто(ДанныеПлатежейСегодня.БанковскийСчет,
		"Платежи", ДанныеПлатежейСегодня.Организация, ДанныеПлатежейСегодня.ДатаАктуальности);
	
	Если СтрНайти(НРег(ИмяЭлемента), "получено") 
		Или СтрНайти(НРег(ИмяЭлемента), "исполнено") Тогда 
		
		ОткрытьФормуОтчета("АнализСубконто", ПараметрыОтчета);
		
	ИначеЕсли СтрНайти(НРег(ИмяЭлемента), "внеплановые") Тогда 
		
		ОткрытьСписокПлатежныхПоручений(ДанныеПлатежейСегодня, Ложь);
		
	ИначеЕсли СтрНайти(НРег(ИмяЭлемента), "планируемые") Тогда 
		
		ГоризонтПланирования = ФинУслугиКлиентСервер.ДнейПланированияКалендаряДляИнфопанели(
			ДанныеПлатежейСегодня.ДатаАктуальности, ТекущаяДата());
			
		ОткрытьПлатежныйКалендарь(ДанныеПлатежейСегодня.Организация, ГоризонтПланирования);
		
	ИначеЕсли СтрНайти(НРег(ИмяЭлемента), "осталосьполучить") Тогда 

		ОткрытьОплатыОтПокупателей(ДанныеПлатежейСегодня);

	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуОтчета(ИмяОтчета, ПараметрыОтчета) Экспорт

	ФормаОтчета = ПолучитьФорму(СтрШаблон("Отчет.%1.ФормаОбъекта", ИмяОтчета), 
		ПараметрыОтчета, ЭтотОбъект, Новый УникальныйИдентификатор);
		
	ФормаОтчета.Отчет.Организация = ПараметрыОтчета.Организация; 
	
	Если ПараметрыОтчета.Свойство("ПоказательЗадолженность") Тогда
		ФормаОтчета.Отчет.ПоказательЗадолженность = ПараметрыОтчета.ПоказательЗадолженность;
	КонецЕсли;
	
	Если ПараметрыОтчета.Свойство("ПоказательПросроченнаяЗадолженность") Тогда
		ФормаОтчета.Отчет.ПоказательПросроченнаяЗадолженность = ПараметрыОтчета.ПоказательПросроченнаяЗадолженность;
	КонецЕсли;
	
	Если СтрНайти(ИмяОтчета,"ПоСрокамДолга") > 0 Тогда
		ФормаОтчета.Отчет.Период = ПараметрыОтчета.ДатаАктуальности;
	ИначеЕсли СтрНайти(ИмяОтчета,"АнализСубконто") > 0 Тогда
		ФормаОтчета.Отчет.НачалоПериода = ПараметрыОтчета.НачалоПериода;
		ФормаОтчета.Отчет.КонецПериода = ПараметрыОтчета.КонецПериода;
	ИначеЕсли СтрНайти(ИмяОтчета,"АнализНеоплаченныхСчетов") = 0 Тогда
		ФормаОтчета.Отчет.НачалоПериода = НачалоМесяца(ПараметрыОтчета.ДатаАктуальности);
		ФормаОтчета.Отчет.КонецПериода = КонецДня(ПараметрыОтчета.ДатаАктуальности);
	КонецЕсли;
	
	// Для всех открываемых отчетов кроме Анализа субконто
	Если Не ПараметрыОтчета.Свойство("РежимРасшифровки") Тогда 
		ФормаОтчета.ПодключитьОбработчикОжидания("Подключаемый_СформироватьПриОткрытии",
		БухгалтерскиеОтчетыКлиент.ИнтервалЗапускаФормированияОтчетаПриОткрытии(),
			Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ФормаОтчета.Элементы.Результат,
			"ФормированиеОтчета"); 
	КонецЕсли;
	
	ФормаОтчета.Открыть();

КонецПроцедуры

Функция ПользовательскиеНастройкиОтчета(МассивОтборов, МассивГруппировок, МассивСвойств) Экспорт
		
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	ПользовательскиеОтборы = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	ПользовательскиеОтборы.ИдентификаторПользовательскойНастройки = "Отбор";
	Для Каждого ПользовательскийОтбор Из МассивОтборов Цикл  
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(ПользовательскиеОтборы, ПользовательскийОтбор.ИмяОтбора,
			ПользовательскийОтбор.Отбор, ПользовательскийОтбор.ВидСравнения);
	КонецЦикла;
		
	ТабличнаяЧастьГруппировка = Новый Массив; 
	Для Каждого ПользовательскаяГруппировка Из МассивГруппировок Цикл
		ДобавитьГруппировку(ТабличнаяЧастьГруппировка, ПользовательскиеНастройки, 
			ПользовательскаяГруппировка.Имя, ПользовательскаяГруппировка.Представление);
	КонецЦикла;
	
	Для Каждого ПользовательскоеСвойство Из МассивСвойств Цикл
		 ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(ПользовательскоеСвойство.ИмяСвойства, ПользовательскоеСвойство.ЗначениеСвойства);
	КонецЦикла;
	
	Возврат ПользовательскиеНастройки;
	
КонецФункции

Процедура ДобавитьВМассивОтборов(Массив, ИмяОтбора, Отбор, ПользовательскийВидСравнения) Экспорт
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяОтбора", ИмяОтбора);
	СтруктураОтбора.Вставить("Отбор", Отбор);
	СтруктураОтбора.Вставить("ВидСравнения", ПользовательскийВидСравнения);
	
	Массив.Добавить(СтруктураОтбора);
		
КонецПроцедуры

Процедура ДобавитьВМассивГруппировок(Массив, Имя, Представление) Экспорт
	
	СтруктураГруппировки = Новый Структура;
	СтруктураГруппировки.Вставить("Имя", Имя);
	СтруктураГруппировки.Вставить("Представление", Представление);
		
	Массив.Добавить(СтруктураГруппировки);
		
КонецПроцедуры

Процедура ДобавитьГруппировку(ТабличнаяЧастьГруппировка, ПользовательскиеНастройки, Поле, Представление) Экспорт
	
	ТипГруппировкиОтчетов = БухгалтерскиеОтчетыКлиентСервер.ТипГруппировки();
	ОписаниеГруппировки = БухгалтерскиеОтчетыКлиентСервер.НовыйСтрокаГруппировки(); 
	ОписаниеГруппировки.Использование =  Истина;
	ОписаниеГруппировки.Поле = Поле;
	ОписаниеГруппировки.Представление = Представление;
	ОписаниеГруппировки.ТипГруппировки = ТипГруппировкиОтчетов.Элементы;
	ТабличнаяЧастьГруппировка.Добавить(ОписаниеГруппировки);
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Группировка", ТабличнаяЧастьГруппировка);
	
КонецПроцедуры

Процедура ОткрытьПлатежныйКалендарь(Организация, ДнейПланирования = Неопределено) Экспорт 
	
	ПараметрыФормы = Новый Структура("Организация, ДнейПланирования, СформироватьПриОткрытии", 
		Организация, ДнейПланирования, Истина);
	ОткрытьФорму("Обработка.ПлатежныйКалендарь.Форма", ПараметрыФормы);

КонецПроцедуры

Процедура ОткрытьОплатыОтПокупателей(ДанныеПлатежейСегодня) Экспорт 
	
	ПараметрыФормы = Новый Структура("Организация, ДатаОплаты", 
		ДанныеПлатежейСегодня.Организация, ДанныеПлатежейСегодня.ДатаАктуальности);
	ОткрытьФорму("Обработка.ОжидаемаяОплатаОтПокупателей.Форма", ПараметрыФормы);

КонецПроцедуры

Процедура ОткрытьСписокПлатежныхПоручений(ДанныеПлатежейСегодня, ВсеПлатежи) Экспорт
	
	Если Не ВсеПлатежи И ДанныеПлатежейСегодня.МассивПлатежныхПоручений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;

	НаименованиеФормы = "Документ.ПлатежноеПоручение.Форма.ФормаСписка";
	ОтборСписка = Новый Структура;
	ОтборСписка.Вставить("Состояние", ФинУслугиКлиентСервер.СостоянияПлатежныхПоручений());
	
	Если ЗначениеЗаполнено(ДанныеПлатежейСегодня.ДатаАктуальности) 
		И НачалоДня(ДанныеПлатежейСегодня.ДатаАктуальности) <> НачалоДня(ТекущаяДата()) Тогда
		ОтборСписка.Вставить("ДатаОтбора", ДанныеПлатежейСегодня.ДатаАктуальности);
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеПлатежейСегодня.Организация) Тогда
		ОтборСписка.Вставить("Организация", ДанныеПлатежейСегодня.Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПлатежейСегодня.БанковскийСчет) Тогда
        ОтборСписка.Вставить("СчетОрганизации", ДанныеПлатежейСегодня.БанковскийСчет);
	ИначеЕсли ЗначениеЗаполнено(ДанныеПлатежейСегодня.Банк) Тогда
		ОтборСписка.Вставить("БанкСчетаОрганизации", ДанныеПлатежейСегодня.Банк);
	КонецЕсли;
	
	Если Не ВсеПлатежи И ЗначениеЗаполнено(ДанныеПлатежейСегодня.МассивПлатежныхПоручений) Тогда
		ОтборСписка.Вставить("Ссылка", ДанныеПлатежейСегодня.МассивПлатежныхПоручений);
	КонецЕсли;

	ПараметрыФормы.Вставить("Отбор", ОтборСписка);
	ОткрытьФормуСОтбором(НаименованиеФормы, ПараметрыФормы);
	
КонецПроцедуры

Процедура ОткрытьФормуСОтбором(НаименованиеФормы, ПараметрыФормы) Экспорт
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.ИмяФормы = НаименованиеФормы;
	ПараметрыОткрытия.Уникальность = Новый УникальныйИдентификатор;
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
		
КонецПроцедуры

Процедура НачатьЗаполнениеКалендаря(Форма) Экспорт

	ФинУслугиКлиентСервер.УстановитьВидимостьДанныхПлатежи(Форма, Ложь, Неопределено);
	УстановитьНадписьПолучениеДанных(Форма, 0);
	ОжидатьЗаполнениеКалендаря(Форма);
		
КонецПроцедуры

// Проверяет видимость инфопанели и обновляет данные в хранилище общих настроек
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма объекта-владельца, в которой размещена панель;
//
Процедура ПередЗакрытием(Форма) Экспорт
		
	ВидимостьПанели = Форма.Элементы.ГруппаПанельИнформации.Видимость;
	
	Если ВидимостьПанели Тогда

		ФинУслугиВызовСервера.ОбработатьСостояниеИнфоПанели();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьВидимостьПанелиИнформации(Форма) Экспорт
	
	Элементы = Форма.Элементы;
    Элементы.ГруппаПанельИнформации.Видимость = Не Элементы.ГруппаПанельИнформации.Видимость;
    
	Если Не Элементы.ГруппаПанельИнформации.Видимость Тогда
		ФинУслугиВызовСервера.ОбработатьЗакрытиеИнфоПанели();
	КонецЕсли;
	
	НастроитьОтображениеКомандыПоказатьПанельИнформации(Форма, Элементы.ГруппаПанельИнформации.Видимость);
	
КонецПроцедуры

Процедура НастроитьОтображениеКомандыПоказатьПанельИнформации(Форма, ПоказатьПанель) Экспорт
	
	Элементы = Форма.Элементы;
	Если ПоказатьПанель Тогда
		Элементы.ПоказатьПанельИнформации.Картинка = БиблиотекаКартинок.СтрелкаВправо;
	Иначе
		Элементы.ПоказатьПанельИнформации.Картинка = БиблиотекаКартинок.СтрелкаВлево;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредотвратитьСбросРедактируемогоЗначения(ТекущийЭлемент) Экспорт
	
	// Обход особенности платформы, когда затирается редактируемое значение
	// в текущем элементе при изменении формы.
	Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		Если ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") И ТекущийЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
			ТекущийЭлемент.ОбновлениеТекстаРедактирования = ОбновлениеТекстаРедактирования.ПриИзмененииЗначения;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыОтчетаАнализСубконто(Отбор, Раздел, Организация, ДатаАктуальности) Экспорт
	
	ГруппировкиИСчета = ФинУслугиВызовСервера.СтруктураГруппировокИСчетов(Раздел);
    СчетаРасчетов = ГруппировкиИСчета.СчетаРасчетов;
	Группировки = ГруппировкиИСчета.Группировки;
	СписокВидовСубконто = ГруппировкиИСчета.СписокВидовСубконто;
	
	МассивОтборов = Новый Массив;
	Если ЗначениеЗаполнено(Отбор) Тогда
		ДобавитьВМассивОтборов(МассивОтборов, "Субконто1", Отбор, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	ДобавитьВМассивОтборов(МассивОтборов, "Счет", СчетаРасчетов, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
	
	МассивГруппировок = Новый Массив;
	
	Для Каждого СтрокаГруппировок Из Группировки Цикл
		ДобавитьВМассивГруппировок(МассивГруппировок, СтрокаГруппировок.Имя, СтрокаГруппировок.Значение);
	КонецЦикла;
	
	МассивСвойств = Новый Массив;
	ДобавитьВМассивСвойств(МассивСвойств, "СписокВидовСубконто", СписокВидовСубконто);
	ДобавитьВМассивСвойств(МассивСвойств, "ПоСубсчетам", Истина);
	ДобавитьВМассивСвойств(МассивСвойств, "НачалоПериода", НачалоДня(ДатаАктуальности));
	ДобавитьВМассивСвойств(МассивСвойств, "КонецПериода", КонецДня(ДатаАктуальности));
    ДобавитьВМассивСвойств(МассивСвойств, "Организация", Организация);

	ПользовательскиеНастройки = ПользовательскиеНастройкиОтчета(МассивОтборов, МассивГруппировок, МассивСвойств);
		
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	ПараметрыОтчета.Вставить("ПоСубсчетам", Истина);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);  
	ПараметрыОтчета.Вставить("РежимРасшифровки", Истина);
	ПараметрыОтчета.Вставить("ВидРасшифровки", 2);
	ПараметрыОтчета.Вставить("Организация", Организация);
   	ПараметрыОтчета.Вставить("НачалоПериода", НачалоДня(ДатаАктуальности));
	ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ДатаАктуальности));

	Возврат ПараметрыОтчета;
	
КонецФункции

Процедура ДобавитьВМассивСвойств(Массив, ИмяСвойства, ЗначениеСвойства)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяСвойства", ИмяСвойства);
	СтруктураОтбора.Вставить("ЗначениеСвойства", ЗначениеСвойства);
		
	Массив.Добавить(СтруктураОтбора);
		
КонецПроцедуры

#КонецОбласти 

#Область ПредложенияФинУслуг

Процедура ОбновитьФормуПослеОбновленияДанныхСервиса(Форма, ТекстОшибки)
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Форма.СведенияОСервисе.ОписаниеОшибки = ТекстОшибки; 
	Иначе 
		Форма.СведенияОСервисе.ДанныеАктуальны = Истина;
	КонецЕсли;
	
	
	Если ФинУслугиКлиентСервер.ЭтоФормаФинансыОрганизации(Форма.ИмяФормы) Тогда
		Форма.ОбновитьФормуПослеОбновленияДанныхСервиса();
		Возврат;
	ИначеЕсли ФинУслугиКлиентСервер.ЭтоФормаБанковскогоСчета(Форма.ИмяФормы) Тогда
		
		Если Не ЗначениеЗаполнено(Форма.Объект.Банк) Тогда
			ФинУслугиКлиентСервер.УстановитьВидимостьФинУслуги(Форма, Ложь);
			Возврат; 
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Функция СоответствиеСервисыУслуги()
	
	Результат = Новый Соответствие;
	Результат.Вставить("УслугаСБП", СервисСБП());
	Результат.Вставить("УслугаЭквайринг", СервисЭквайринг());
	Результат.Вставить("УслугаБизнесКарты", СервисБизнесКарты());
    Результат.Вставить("УслугаЗарплатныйПроект", СервисЗарплатныйПроект());

	Возврат Результат;

КонецФункции

#КонецОбласти
